{
    "jobs": [
      {
        "id": "gd-1009604300725",
        "site": "glassdoor",
        "job_url": "https://www.glassdoor.com/job-listing/j?jl=1009604300725",
        "job_url_direct": "",
        "title": "PHP Web Developer",
        "company": "Exlvis Solutions pvt Ltd",
        "location": "Navi Mumbai",
        "date_posted": "2025-01-19",
        "job_type": "",
        "salary_source": "direct_data",
        "interval": "monthly",
        "min_amount": "25000.0",
        "max_amount": "25000.0",
        "currency": "INR",
        "is_remote": "False",
        "job_level": "",
        "job_function": "",
        "listing_type": "organic",
        "emails": "",
        "description": "Exlvis Solutions Pvt Ltd is a professionally managed Enterprises Solutions and Business Process Re\\-engineering Company.  \n**Current Openings :** Software Programmer (Job Code : SE02\\) Position opening 2 Experience : 1 yrs \\- 3 yrs. Technology **PHP , MySql** Location : Navi Mumbai Position : Software  \nIndustry:\n\n* Software Development\n\nJob Type: Full\\-time  \nSalary: ₹10,000\\.00 \\- ₹20,000\\.00 per month  \nSchedule:\n\n* Monday to Friday\n\nSupplemental Pay:\n\n* Overtime pay\n* Performance bonus\n\nLanguage:\n\n* My Sql (Required)\n\nQualfication: Any Graduate\n\nJob Types: Full\\-time, Permanent\n\nPay: From ₹25,000\\.00 per month\n\nBenefits:\n\n* Internet reimbursement\n\nSchedule:\n\n* Day shift\n\nAbility to commute/relocate:\n\n* Navi Mumbai, Belapur \\- 400614, Maharashtra: Reliably commute or planning to relocate before starting work (Preferred)\n\nEducation:\n\n* Bachelor's (Preferred)\n\nExperience:\n\n* PHP: 1 year (Required)\n* total work: 1 year (Required)\n* software development: 1 year (Required)\n\nLicense/Certification:\n\n* PHP (Required)\n\nExpected Start Date: 19/01/2025",
        "company_industry": "",
        "company_url": "https://www.glassdoor.com/Overview/W-EI_IE818080.htm",
        "company_logo": "https://media.glassdoor.com/sql/818080/exlvis-solution-squarelogo-1637907075743.png",
        "company_url_direct": "",
        "company_addresses": "",
        "company_num_employees": "",
        "company_revenue": "",
        "company_description": ""
      },
      {
        "id": "gd-1009603714012",
        "site": "glassdoor",
        "job_url": "https://www.glassdoor.com/job-listing/j?jl=1009603714012",
        "job_url_direct": "",
        "title": "Senior Angular Developer",
        "company": "Codezen Tech Solutions",
        "location": "India",
        "date_posted": "2025-01-18",
        "job_type": "",
        "salary_source": "direct_data",
        "interval": "yearly",
        "min_amount": "600000.0",
        "max_amount": "1000000.0",
        "currency": "INR",
        "is_remote": "False",
        "job_level": "",
        "job_function": "",
        "listing_type": "organic",
        "emails": "",
        "description": "**About Company**: Codezen Tech Solutions is a technical consultancy and development firm that believes in increasing transparency and efficiency using cloud based platforms. We are looking for an Angular 6\\+ developer who can take ownership for the whole end to end delivery, performing analysis, design, coding, testing, and maintenance of large\\-scale and distributed applications.\n\n**Responsibilities and Duties:**\n\n* Strong skill and working experience on developing and maintaining Angular apps\n* Strong knowledge around JavaScript, HTML, CSS, SASS, Responsive designs etc.\n* Solid experience with unit testing of frontend components\n* Make design and technical decisions for Angular project Design, Development, Testing, and Deployment of front\\-end applications.\n* Identify bottlenecks and bugs, and recommend system, solutions by comparing advantages and disadvantages of custom development.\n* Contributing to team meetings, troubleshooting development and production problems across multiple environments and operating platforms.\n* Continuously discover, evaluate, and implement new technologies to maximize development efficiency.\n* Understanding the requirement of a client, document the scope and chart out a plan of implementing the scope\n* Work with design team to give inputs related to the wire\\-frames and then the design along with incorporating Client Feedback\n* Explore the difference between B2B and B2C projects before implementing the code\n* Design and develop highly scalable, highly available, reliable, secure, and fault\\-tolerant systems with minimal guidance for one of the fastest\\-growing companies in India.\n\n**Required Experience, Skills and Qualifications:**\n\n* 3\\+ years of experience required in Angular.\n* Good knowledge of SCSS, HTML5, Bootstrap 4, TypeScript\n* Solid understanding of object\\-oriented programming.\n* Experience building object\\-oriented web applications in JavaScript, HTML5, and CSS3, TypeScript\n* Experience with HTML/CSS and developing/customizing User Interfaces\n* Expertise in Javascript, Angular 6, JQuery.\n* Ability to work independently and deliver quality work.\n* Ability to quickly adapt \\& independently work in a fast\\-paced Agile environment with minimum supervision.\n* A self\\-starter with demonstrated ability to take initiative, who can proactively identify issues/opportunities and recommend action.\n\nJob Types: Full\\-time, Permanent\n\nPay: ₹600,000\\.00 \\- ₹1,000,000\\.00 per year\n\nBenefits:\n\n* Flexible schedule\n* Paid sick time\n* Work from home\n\nSchedule:\n\n* Day shift\n* Morning shift\n\nSupplemental Pay:\n\n* Performance bonus\n* Quarterly bonus\n* Yearly bonus\n\nApplication Question(s):\n\n* How soon can you join?\n\nExperience:\n\n* Angular: 3 years (Required)\n\nLanguage:\n\n* English (Preferred)\n\nWillingness to travel:\n\n* 75% (Preferred)\n\nWork Location: In person",
        "company_industry": "",
        "company_url": "",
        "company_logo": "",
        "company_url_direct": "",
        "company_addresses": "",
        "company_num_employees": "",
        "company_revenue": "",
        "company_description": ""
      },
      {
        "id": "gd-1009604269314",
        "site": "glassdoor",
        "job_url": "https://www.glassdoor.com/job-listing/j?jl=1009604269314",
        "job_url_direct": "",
        "title": "Data Scientist",
        "company": "Dimexon Diamonds Ltd",
        "location": "India",
        "date_posted": "2025-01-18",
        "job_type": "",
        "salary_source": "direct_data",
        "interval": "yearly",
        "min_amount": "2500000.0",
        "max_amount": "2500000.0",
        "currency": "INR",
        "is_remote": "False",
        "job_level": "",
        "job_function": "",
        "listing_type": "organic",
        "emails": "",
        "description": "**Job Title :** Data scientist\n\n**Job Summary :**\n\nLeverage data analytics and ML use case implementation at Dimexon to support business activities e.g. production forecasting, and distribution; collaborate with cross\\-functional teams and help drive operational excellence, profitability, and optimize value chain.\n\n**Key Responsibilities :**\n\n**Strategic :**\n\n\\-Support leadership to identify and implement digital strategy and advanced analytics adoption roadmap across functions aligning technologies to business goals\n\n\\- Improve digital capabilities against industry standards and stay abreast with latest developments\n\n\\- Manage relationships with external vendors/ service providers, integrate seamlessly with internal systems and facilitate necessary trainings\n\n\\- Implement robust data governance frameworks, maintain and structure database to ensure data integrity, accuracy, and availability; comply with data privacy, security etc.\n\n**Analytics use case implementation :**\n\n\\- Implement identified use cases (e.g., demand forecasting, production planning, SKU volatility) and digital/ tech. interventions required (e.g., Gen AI driven marketing/ customer support, IoT tool for predictive maintenance, workflow and process optimization tools)\n\n\\- Manage data collection (incl. from external agencies) and maintain data pipelines to ensure seamless integration of real\\-time and batch data across sources\n\n\\- Drive statistical analysis to model key inputs/ metrics like production, demand, pricing across multiple sources (e.g., web scrapping, secondary research, customer data), generate data insights, detect anomalies and support identified use cases (e.g. mfg. optimization, enhanced customer experience, SKU optimization)\n\n\\- Build dashboards and reporting systems using tools (e.g., Tableau, Power BI, Python, R, etc.) to monitor critical business KPIs and streamline functions, minimizing manual intervention\n\n\\- Develop ML models, liaising with external vendors as needed, to optimize production processes, predictive maintenance, demand forecasting, and yield optimization\n\n**Qualifications :**\n\n\\- B.Tech / Bachelor's/ Master's Degree in Applied Statistics, Mathematics, Data Science or related quantitative field\n\n**Skills and Competencies :**\n\n**Soft skills :**\n\n\\- Strong analytical and problem\\-solving skill, ability to drive critical insights, excellent communication and presentation skills, collaborative mindset with ability to work across teams, attention to detail and commitment to data quality and accuracy\n\n**Technical skills (added plus) :**\n\n\\- Proficiency in programming and data query languages (e.g. Python, R, SQL etc.), ML and data pipeline frameworks, data visualization tools (Tableau), cloud platforms (AWS, Azure) experience in predictive modeling, anomaly detection, etc.\n\n**Experience :**\n\n\\- 3\\-7 years of experience in building digital and analytics solutions for large/ mid scale players (in manufacturing setup, preferably in luxury industry), experience managing third party data science vendors is a plus\n\n**Location :** Mumbai\n\n**Company Overview :**\n\nDimexon Diamonds Ltd, with sales offices in all 4 corners of the globe, is one of the world's leading diamond manufacturers. Specialized in calibrated round goods and ahead of its time when it comes to innovating systems and processes, we are the preferred partner to some of the world's most exclusive watch and jewellery brands.\n\nJob Types: Full\\-time, Permanent\n\nPay: Up to ₹2,500,000\\.00 per year\n\nBenefits:\n\n* Flexible schedule\n\nSchedule:\n\n* Day shift\n\nApplication Question(s):\n\n* Are you comfortable with six days working (Monday \\- Saturday)?\n* What is your current CTC?\n* What is your expected CTC?\n* What is your notice period?\n\nExperience:\n\n* Data science: 3 years (Required)\n* Manufacturing: 1 year (Preferred)\n\nWork Location: In person",
        "company_industry": "",
        "company_url": "",
        "company_logo": "",
        "company_url_direct": "",
        "company_addresses": "",
        "company_num_employees": "",
        "company_revenue": "",
        "company_description": ""
      },
      {
        "id": "gd-1009603054716",
        "site": "glassdoor",
        "job_url": "https://www.glassdoor.com/job-listing/j?jl=1009603054716",
        "job_url_direct": "",
        "title": "Support Analyst",
        "company": "TIAA",
        "location": "Mumbai",
        "date_posted": "2025-01-18",
        "job_type": "",
        "salary_source": "direct_data",
        "interval": "yearly",
        "min_amount": "750000.0",
        "max_amount": "1000000.0",
        "currency": "INR",
        "is_remote": "False",
        "job_level": "",
        "job_function": "",
        "listing_type": "organic",
        "emails": "accessibility.support@tiaa.org",
        "description": "The Senior Support Analyst assists with the analysis of business and information needs in order to design optimal systems solutions. Working under close supervision, this job helps to design system solutions that are appropriate for business needs and consistent with the overall design of the organization's information systems architecture. This job also identifies improvements to the existing information technology (IT) systems and processes.  \n\n  \n\nKey Responsibilities and Duties* Identifies business needs, conducts requirement gathering, and defines scope and objectives of each project.\n  \n* Makes recommendations for solutions or improvements to business processes that can be accomplished through new technology or alternative uses of existing technology.\n  \n* Assists with the translation of business requirements into application requirements, and works with all members of the team to communicate the changes to the application successfully.\n  \n* Identify and escalate conflicts, issues and changes in order to appropriately manage scope.\n  \n* Maintains technical documentation to guide system users and to assist with the ongoing operation, maintenance, and development of the system.\n  \n* Seeks advice from senior management regarding challenging system circumstances and other problems that require a more complex understanding of information technology (IT) systems and processes.\n\n\nEducational Requirements* University (Degree) Preferred\n\n\nWork Experience* No Experience Required\n\n\nPhysical Requirements* Physical Requirements: Sedentary Work\n\n  \n\nCareer Level  \n\n 5IC  \n\nPosition Summary:\nProvide full Product Life cycle \\- analysis, development, support and complex problem resolution for Omni DC application. Work as part of an IT team with other analysts to remediate production issues, proactively maintain the efficiency of applications and provide subject matter expertise on assigned applications and processes.\nKey Duties \\& Responsibilities:\nPrimary Responsibilities:* Analysis, Development, Maintenance and Support for Omni DC Application.\n* Provide accurate estimates and timelines for work requested.\n* Strong proficiency in developing with COBOL within a mainframe environment\n* Document application functionality and processing\n* Identify and document risks to current efforts and estimated efforts\n* Identify and improve gaps in job/application efficiencies\n* Follow up with internal customers regarding business functional understanding, delivery schedule and acceptance.\n* Prepare reports and graphs to be distributed to internal stakeholders and management\n\n\nFunctional Knowledge: What knowledge of concepts, process, principles or procedures is needed within discipline; SME?* Familiarity with Omni Plus/Omni Trade/Omni Pay\n* Knowledge of pension products like 401k, 403b, etc.\n\n\nBusiness or Industry Expertise: Describe the degree of knowledge and understanding required of TIAA’s business and industry, commercial environment and of competitors products and services.\n3 to 6 years of relevant work experience.\nInteractions / Interpersonal Skills: Describe the nature and level of interactions this job has with others, both internally and externally. Explain any specific interpersonal skills necessary to successfully perform this role (i.e., negotiation skills, represents business at external events or to governmental bodies, etc. ).\nYes. Solid oral and written communication skills\nJob Requirements And Qualifications: Indicate the minimum and preferred education and experience for the job and any licenses and certifications required\nRequired Education:\nOther\nGraduate\nPreferred Education:\nOther\nEngineering / MCA\nSkills and Abilities:\nMandatory Skills* Strong IBM Mainframe development experience\n\t+ OS JCL\n\t+ OS Utilities/IBM Utilities\n\t+ TSO/ISPF\n\t+ COBOL\n* Strong work ethic, self\\-starter, focus on customer service, good communications and people skills, team player,\n\n\nPreferred Requirements:* Understanding of Windows Server/UNIX\n* Basic understanding of US Retirement Products/Insurances.\n* Basic Understanding of Mainframe/Legacy applications, JCL/Job Execution, CA7 Schedules, NDM File transfers\n\n\nRelated Skills\nAgile Methodology, Continuous Integration and Deployment, Data Analysis, Debugging, DevOps, Enterprise Application Integration, Operating Systems Management, Problem Solving, Programming, Software Development, Software Development Life Cycle, Web Application Development\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\nCompany Overview\nTIAA Global Capabilities was established in 2016 with a mission to tap into a vast pool of talent, reduce risk by insourcing key platforms and processes, as well as contribute to innovation with a focus on enhancing our technology stack. TIAA Global Capabilities is focused on building a scalable and sustainable organization , with a focus on technology , operations and expanding into the shared services business space.  \n\n  \n\nWorking closely with our U.S. colleagues and other partners, our goal is to reduce risk, improve the efficiency of our technology and processes and develop innovative ideas to increase throughput and productivity.\nWe are an Equal Opportunity/Affirmative Action Employer. We consider all qualified applicants for employment regardless of age, race, color, national origin, sex, religion, veteran status, disability, sexual orientation, gender identity, or any other protected status.\nAccessibility Support\nTIAA offers support for those who need assistance with our online application process to provide an equal employment opportunity to all job seekers, including individuals with disabilities.\nIf you are a U.S. applicant and desire a reasonable accommodation to complete a job application please use one of the below options to contact our accessibility support team:\nPhone: (800\\) 842\\-2755\nEmail: accessibility.support@tiaa.org",
        "company_industry": "",
        "company_url": "https://www.glassdoor.com/Overview/W-EI_IE2998.htm",
        "company_logo": "https://media.glassdoor.com/sql/2998/tiaa-squareLogo-1714764717158.png",
        "company_url_direct": "",
        "company_addresses": "",
        "company_num_employees": "",
        "company_revenue": "",
        "company_description": ""
      },
      {
        "id": "gd-1009601327201",
        "site": "glassdoor",
        "job_url": "https://www.glassdoor.com/job-listing/j?jl=1009601327201",
        "job_url_direct": "",
        "title": "Software Tester Intern",
        "company": "Convergence IT Services",
        "location": "Mumbai",
        "date_posted": "2025-01-17",
        "job_type": "",
        "salary_source": "direct_data",
        "interval": "monthly",
        "min_amount": "8000.0",
        "max_amount": "8000.0",
        "currency": "INR",
        "is_remote": "False",
        "job_level": "",
        "job_function": "",
        "listing_type": "organic",
        "emails": "",
        "description": "Job Title: Software Tester Intern\n\nDepartment: Quality Assurance\n\nReports to: Quality Analyst/ Implementation Lead\n\nThis internship is for ***6 months full time work from office internship***.\n\nLocation: Vidyavihar (W), Mumbai, Maharashtra, India.\n\nSummary:\n\nThe Software Tester Intern is responsible for supporting the QA team in testing software applications. This includes tasks such as writing test cases, executing tests, and reporting defects. The ideal candidate will be a highly motivated and detail\\-oriented individual with strong analytical and problem\\-solving skills.\n\nResponsibilities:\n\n* Write and execute test cases for web and mobile applications\n* Perform manual testing, including smoke testing, functional testing, and regression testing\n* Use automation testing tools to automate test cases\n* Report defects and track their progress\n* Work with developers to resolve defects\n* Document test results and findings\n* Stay up\\-to\\-date on new testing methodologies and tools\n\nQualifications:\n\n* Strong analytical and problem\\-solving skills\n* Excellent written and verbal communication skills\n* Proficient in using Microsoft Office Suite\n* Experience with Agile methodologies is a plus\n* Experience with test case management tools is a plus\n* Experience with automation testing tools is a plus\n\nJob Types: Full\\-time, Internship  \nContract length: 6 months\n\nPay: Up to ₹8,000\\.00 per month\n\nSchedule:\n\n* Day shift\n\nAbility to commute/relocate:\n\n* Mumbai Suburban, Maharashtra: Reliably commute or planning to relocate before starting work (Required)\n\nApplication Question(s):\n\n* What is your Notice Period?\n* What is your Current CTC?\n* What is your Expected ctc?\n\nEducation:\n\n* Bachelor's (Preferred)\n\nWork Location: In person",
        "company_industry": "",
        "company_url": "",
        "company_logo": "",
        "company_url_direct": "",
        "company_addresses": "",
        "company_num_employees": "",
        "company_revenue": "",
        "company_description": ""
      },
      {
        "id": "gd-1009601542806",
        "site": "glassdoor",
        "job_url": "https://www.glassdoor.com/job-listing/j?jl=1009601542806",
        "job_url_direct": "",
        "title": "Associate Backend Engineer - PivotConsult",
        "company": "Havas Group",
        "location": "Mumbai",
        "date_posted": "2025-01-17",
        "job_type": "",
        "salary_source": "direct_data",
        "interval": "yearly",
        "min_amount": "198000.0",
        "max_amount": "500000.0",
        "currency": "INR",
        "is_remote": "False",
        "job_level": "",
        "job_function": "",
        "listing_type": "organic",
        "emails": "",
        "description": "On\\-site\nAgency :\nPivotRoots\nJob Description Summary :\nPivotRoots is looking for a Backend Engineering role for CSA Team.\nJob Description :\nJob description* Developing ETL Pipelines: Designing, developing, and maintaining scalable and adaptable data pipelines using Python or PySpark to facilitate the smooth migration of data from diverse data sources . Host these ETL pipelines in AWS EC2, AWS Glue or AWS EMR and store this data to cloud database services like Google BigQuery, AWS S3, Redshift, RDS, Delta Lake etc. This includes managing significant data migrations and ensuring seamless transitions between systems.\n* Implementing Data Quality Check Framework: Establishing and executing data quality checks and validation pipelines using different tools like Python, PySpark, Athena or BigQuery, S3, Delta Lake to uphold the integrity and accuracy of our datasets.\n* Creating Mechanisms for Generating ETL Migration Status Reports: Devising a framework to generate concise summary reports detailing data migration progress, alongside promptly alerting stakeholders to any failures within ETL pipelines. This ensures swift resolution of data discrepancies arising from pipeline failures. Implement this using standard SMTP, Python, AWS SNS, AWS SES, AWS S3, Delta Lake etc services.\n* Data Transformations and Processing: Implementing various data encryption and decryption techniques using Python and PySpark libraries, in addition to generating insightful reports and analyses derived from processed data to aid in informed business decision\\-making.\n* Development of APIs: Building APIs using frameworks such as Flask or Django, incorporating diverse authentication and authorization techniques to safeguard the exchange of data. Host these API’s on EC2 server using services like Gearman etc or Write API logics in lambda and host these API’s using API Gateway services of cloud.\n* Code Versioning and Deployment: Leveraging GitHub extensively for robust code versioning, deployment of the latest code iterations, seamless transitioning between different code versions, and merging various branches to streamline development and code release processes.\n* Automation: Designing and implementing code automation solutions to streamline and automate manual tasks effectively.\n\n\nRequired Candidate profile\nSoft Skills  \n\nMust Have:* Demonstrates adept problem\\-solving skills to efficiently address complex challenges encountered during data engineering tasks.\n* Exhibits clear and effective communication skills, facilitating seamless collaboration and comprehension across diverse teams and stakeholders.\n* Displays proficiency in both independent and collaborative work dynamics, fostering productivity and synergy within a fast\\-paced team environment.\n* Demonstrates a high level of adaptability to changing requirements, customer dynamics, and work demands.\n* Self\\-motivated and responsible individual who takes ownership and initiative in tasks.\n\n  \n\nGood to Have:* Demonstrates project management experience, offering valuable insights and contributions towards efficient project execution and delivery.\n* Good Presentation skills\n* Excellent customer handling skills.\n\n\nTechnical Skills* Proficiency in SQL (Structured Query Language) for querying and manipulating databases. Experience with relational database systems like MySQL, PostgreSQL, or Oracle and NoSQL databases like Mongo.\n* Proficiency in object\\-oriented programming concepts such as encapsulation, inheritance, and polymorphism.\n* Knowledge of data warehousing concepts and experience with data warehousing solutions like Amazon Redshift, Google BigQuery, or Snowflake.\n* Experienced in developing ETL pipelines using Python, PySpark.\n* Knowledge of Python libraries/frameworks like Pandas, NumPy, or Spark for data processing and analysis.\n* Familiarity with big data processing frameworks like Apache Hadoop and Apache Spark for handling large\\-scale datasets and performing distributed computing.\n* Knowledge of cloud\\-based services like AWS S3, AWS Glue, AWS EMR, AWS Lambda, Athena, Azure Data Lake, Google BigQuery, etc.\n* Familiarity with version control systems like Git for managing codebase changes, collaborating with team members, and maintaining code quality.\n* Experience with web scraping libraries and frameworks like BeautifulSoup, Scrapy, Puppeteer, Selenium, etc., is highly beneficial. Knowledge of regular expressions is useful for pattern matching and extracting specific data formats from text. Understanding of HTTP protocols and how web servers respond to requests, how to send requests to web servers, handle responses, and manage sessions and cookies is essential. Familiarity with XPath expressions or CSS selectors is important for targeting specific elements within the HTML structure.\n\n\nRequired Experience* The ideal candidate will have a minimum of 1\\-3 years of relevant experience in data engineering roles, with a demonstrated history of successfully developing and maintaining ETL pipelines, handling big data migrations, and ensuring data quality and validation.\n* Must have excellent knowledge and programing capability using Python, PySpark working on any of the Cloud Platforms like AWS, Azure or Google.\n\n\nRole* Industry Type: Engineering\n* Functional Area: Data Engineering, Software Development, Automation\n* Employment Type: Full Time, Permanent\n* Role Category: System Design/Implementation\n* Education : A minimum educational requirement is graduation.\n\n\nHere at Havas across the group we pride ourselves on being committed to offering equal opportunities to all potential employees and have zero tolerance for discrimination. We are an equal opportunity employer and welcome applicants irrespective of age, sex, race, ethnicity, disability and other factors that have no bearing on an individual’s ability to perform their job.\nContract Type :\nPermanent\nHere at Havas across the group we pride ourselves on being committed to offering equal opportunities to all potential employees and have zero tolerance for discrimination. We are an equal opportunity employer and welcome applicants irrespective of age, sex, race, ethnicity, disability and other factors that have no bearing on an individual’s ability to perform their job.",
        "company_industry": "",
        "company_url": "https://www.glassdoor.com/Overview/W-EI_IE10572.htm",
        "company_logo": "https://media.glassdoor.com/sql/10572/havas-squarelogo-1399059388468.png",
        "company_url_direct": "",
        "company_addresses": "",
        "company_num_employees": "",
        "company_revenue": "",
        "company_description": ""
      },
      {
        "id": "gd-1009602719220",
        "site": "glassdoor",
        "job_url": "https://www.glassdoor.com/job-listing/j?jl=1009602719220",
        "job_url_direct": "",
        "title": "Jr. Python Developer",
        "company": "Version Next Technologies Pvt Ltd",
        "location": "India",
        "date_posted": "2025-01-17",
        "job_type": "",
        "salary_source": "direct_data",
        "interval": "monthly",
        "min_amount": "8000.0",
        "max_amount": "18000.0",
        "currency": "INR",
        "is_remote": "False",
        "job_level": "",
        "job_function": "",
        "listing_type": "organic",
        "emails": "",
        "description": "**Job Overview**\n\nWe are looking for a motivated and passionate Junior Python Developer to join our team. The ideal candidate will work on developing and maintaining Python\\-based applications, collaborating with senior developers, and contributing to a variety of projects. This is a great opportunity to learn, grow, and kickstart your career in Python development.\n\n**Key Responsibilities**\n\n* Develop, test, and maintain Python applications and scripts.\n* Assist in the design and implementation of scalable, secure, and efficient software solutions.\n* Debug and resolve software issues and bugs.\n* Write clean, maintainable, and well\\-documented code.\n* Collaborate with cross\\-functional teams to understand project requirements.\n* Perform basic database operations and queries.\n* Participate in code reviews and contribute to team best practices.\n* Stay updated on the latest trends and technologies in Python and software development.\n\n**Skills and Qualifications Must\\-Have:**\n\n* Strong understanding of Python programming language.\n* Familiarity with Python frameworks (e.g., Django, Flask).\n* Basic understanding of front\\-end technologies like HTML, CSS, and JavaScript.\n* Knowledge of RESTful APIs and web services.\n* Basic understanding of version control systems (e.g., Git).\n* Problem\\-solving mindset with attention to detail.\n* Good communication and teamwork skills.\n\n**Nice\\-to\\-Have:**\n\n* Familiarity with databases like MySQL, PostgreSQL, or MongoDB.\n* Experience with Python libraries like NumPy, Pandas, or Matplotlib.\n* Exposure to cloud platforms like AWS, Azure, or GCP.\n* Knowledge of DevOps tools and practices.\n* Basic understanding of machine learning or data science concepts.\n\n**Education and Experience**\n\n* Bachelor’s degree in Computer Science, Engineering, or a related field (or equivalent practical experience).\n* 0–2 years of experience in Python development (fresh graduates are welcome to apply).\n\n**What We Offer**\n\n* Competitive salary and benefits.\n* Opportunity to work on real\\-world projects.\n* Professional growth and learning opportunities.\n* A collaborative and inclusive work environment.\n\nJob Types: Full\\-time, Permanent\n\nPay: ₹8,000\\.00 \\- ₹18,000\\.00 per month\n\nBenefits:\n\n* Health insurance\n\nSchedule:\n\n* Day shift\n* Monday to Friday\n\nAbility to commute/relocate:\n\n* Andheri, Mumbai, Maharashtra: Reliably commute or planning to relocate before starting work (Required)\n\nEducation:\n\n* Bachelor's (Required)\n\nExperience:\n\n* total work: 1 year (Required)\n\nWork Location: In person\n\nExpected Start Date: 18/01/2025",
        "company_industry": "",
        "company_url": "https://www.glassdoor.com/Overview/W-EI_IE6041569.htm",
        "company_logo": "",
        "company_url_direct": "",
        "company_addresses": "",
        "company_num_employees": "",
        "company_revenue": "",
        "company_description": ""
      },
      {
        "id": "gd-1009602840804",
        "site": "glassdoor",
        "job_url": "https://www.glassdoor.com/job-listing/j?jl=1009602840804",
        "job_url_direct": "",
        "title": "UI/UX Designer",
        "company": "Onference training technologies LLP",
        "location": "Mumbai",
        "date_posted": "2025-01-17",
        "job_type": "",
        "salary_source": "direct_data",
        "interval": "monthly",
        "min_amount": "20000.0",
        "max_amount": "35000.0",
        "currency": "INR",
        "is_remote": "False",
        "job_level": "",
        "job_function": "",
        "listing_type": "organic",
        "emails": "",
        "description": "We are looking for a young, imaginative Visual Designer who loves to experiment with cutting edge design styles and has experience working with mobile and web apps.\n\nHe/she will be responsible for enhancing the UI / UX of our web and mobile platform.\n\nCandidates with no full\\-time work experience will be shortlisted only on the basis of some formal education or background in design, a good portfolio showcasing their visual design styles, and some self\\-executed projects on mobile or web apps.\n\n**We expect you to have your own laptop which supports different design softwares \\& apps \\& a wifi with decent internet speed.** Candidates from in \\& around Mumbai (Mumbai, Navi Mumbai, Thane) will be preferred as the role is hybrid \\& will require travel to office for meetings.\n\n**Broad scope of work:** \n\n* Working with product managers \\& Developers to re\\-design our mobile and web apps section by section as well as creating new visual design concepts through detailed flows, wireframes, and prototypes.\n* Work on creating transition effects from one screen to another within mobile and web apps.\n* Understand different design formats \\& create standardized, modern, clean and clutter free designs.\n* Develop \\& maintain design guidelines \\& standards.\n* Support cross\\-functional teams on their design efforts whenever required.\n\n**Capabilities we are looking for:** \n\n* Experience with UI / UX layouts and design.\n* Ability to think out of the box \\& bring a problem\\-solving design/abstract thinking approach\n* Great listening skills in order to understand the brief carefully \\& translate into user\\-centered design solutions.\n* Capacity to collaborate with teams to understand workflows, processes and design solutions \\& convert a written concept note into stunning visual designs.\n* Capability to work on multiple softwares to generate different design formats\n* Ability to design for different use cases and formats. E.g. different design approach for desktop viewing vs. mobile screen viewing.\n* Ability to understand design from a user’s view point.\n* Willingness to learn new softwares to design in different formats.\n\n**Technical skills Preferred:** \n\n* Understanding different design formats to hand over assets to developer team as they require.\n* Creating flow charts to understand user journey.\n* Knowing how to work with softwares like figma to create visual design prototypes, mockups and wireframes.\n* Ability to work with more advanced softwares when complex designs are required\n* Ability to learn new software skills and research new design trends.\n* Ability to work with HTML code will be a plus point.\n\n**About Onference:** \n\nOnference is a mobile and web platform that allows doctors to learn from one another by sharing academic videos instantly. In essence it’s like a combination of YouTube and Netflix, but for doctor videos only.\n\nOur vision is to unify doctors from across the world on our platform, allow them to easily create and share academic videos and thereby change the way they learn.  \nYou can access it on www.onference.in or search for onference app on ios and android.\n\nwebsite \\- www.onference.in  \n· Job type: Full time Hybrid.\n\n· Work hours: 10\\.30 am to 6\\.30 pm, Monday to Friday, and alternate Saturdays working.\n\nJob Type: Full\\-time\n\nPay: ₹20,000\\.00 \\- ₹35,000\\.00 per month\n\nSchedule:\n\n* Day shift\n\nWork Location: Hybrid remote in Mumbai Suburban, Maharashtra",
        "company_industry": "",
        "company_url": "https://www.glassdoor.com/Overview/W-EI_IE5988211.htm",
        "company_logo": "https://media.glassdoor.com/sql/5988211/onference-training-technologies-squarelogo-1647427158787.png",
        "company_url_direct": "",
        "company_addresses": "",
        "company_num_employees": "",
        "company_revenue": "",
        "company_description": ""
      },
      {
        "id": "gd-1009602479169",
        "site": "glassdoor",
        "job_url": "https://www.glassdoor.com/job-listing/j?jl=1009602479169",
        "job_url_direct": "",
        "title": "ReactJS Developer",
        "company": "Unlock Technologies Pvt. Ltd.",
        "location": "India",
        "date_posted": "2025-01-17",
        "job_type": "",
        "salary_source": "direct_data",
        "interval": "yearly",
        "min_amount": "300000.0",
        "max_amount": "300000.0",
        "currency": "INR",
        "is_remote": "False",
        "job_level": "",
        "job_function": "",
        "listing_type": "organic",
        "emails": "",
        "description": "**Company Overview:**\n\nUnlock Technologies Pvt. Ltd. is a dynamic and innovative IT company specializing in FinTech, E\\-Commerce, Web Development, Mobile Applications, UI/UX Design, Web Designs. We pride ourselves on our cutting\\-edge solutions and client\\-centric approach, delivering high\\-quality products and services to businesses of all sizes across various industries.\n\n**Job Description:**\n\nWe are looking for a talented and motivated React Fresher to join our dynamic team. In this role, you will be working on building and maintaining web applications using React.js and Node.js. We welcome candidates eager to learn and grow in a supportive environment.\n\n**Key Responsibilities:**\n\n* Develop user\\-friendly web applications using React.js.\n* Collaborate with backend developers using Node.js to build efficient and scalable web services.\n* Translate design mockups and wireframes into high\\-quality code.\n* Work on RESTful APIs and integrate them with front\\-end interfaces.\n* Maintain code quality, performance, and responsiveness of applications.\n* Debug and optimize existing code to improve performance and user experience.\n* Collaborate with team members and project managers to deliver features on time.\n\n**Requirements:**\n\n* Bachelor's degree in Computer Science, Engineering, or a related field.\n* Proficiency in JavaScript and ES6 features.\n* Hands\\-on experience with React.js (projects, internships, or personal projects).\n* Strong understanding of Node.js and building APIs.\n* Basic knowledge of web technologies such as HTML, CSS, and responsive design.\n* Familiarity with Git for version control.\n* Strong problem\\-solving skills and the ability to work independently as well as part of a team.\n* Good to have experience with Redux for state management in React applications.\n* Good to have familiarity with Express.js for building server\\-side applications.\n* Good to have basic understanding of databases (e.g., MongoDB, MySQL).\n* Knowledge of tools like Webpack, Babel, or other build tools.\n* Familiarity with testing frameworks like Jest or Mocha.\n\nJoin our team at Unlock Technologies and embark on an exciting journey in the world of technology\\-driven business development!\n\nJob Types: Full\\-time, Permanent\n\nPay: From ₹300,000\\.00 per year\n\nBenefits:\n\n* Leave encashment\n* Provident Fund\n\nSchedule:\n\n* Day shift\n\nApplication Question(s):\n\n* Are you currently based in Mumbai?\n\nEducation:\n\n* Bachelor's (Preferred)\n\nExperience:\n\n* total work: 2 years (Preferred)\n\nWork Location: In person\n\nApplication Deadline: 18/01/2025  \nExpected Start Date: 27/01/2025",
        "company_industry": "",
        "company_url": "",
        "company_logo": "",
        "company_url_direct": "",
        "company_addresses": "",
        "company_num_employees": "",
        "company_revenue": "",
        "company_description": ""
      },
      {
        "id": "gd-1009601234918",
        "site": "glassdoor",
        "job_url": "https://www.glassdoor.com/job-listing/j?jl=1009601234918",
        "job_url_direct": "",
        "title": "Sr. Flutter Developer",
        "company": "Website Developers India Pvt. Ltd.",
        "location": "Mumbai",
        "date_posted": "2025-01-17",
        "job_type": "",
        "salary_source": "direct_data",
        "interval": "yearly",
        "min_amount": "200000.0",
        "max_amount": "500000.0",
        "currency": "INR",
        "is_remote": "False",
        "job_level": "",
        "job_function": "",
        "listing_type": "organic",
        "emails": "",
        "description": "**Job Summary:**\n\n* **Job Title: Flutter Developer**\n* **Job Location: Malad West, Mumbai**\n\n**Responsibilities:**\n\n* Design \\& implement new app modules based on the product requirements using the Flutter framework\n* Maintain existing codebases\n* Build reusable code and libraries for future use\n* Integrate user\\-interfaces elements developed by other developers\n* Build user interfaces designed by UIUX designers\n* Integration of data storage solutions\n* Integrate various APIs from third parties\n* Debug existing apps components, fix issues, and avoid regressions\n* Collaborate closely with the teams of UIUX designers, PMs, QAs, and other developers\n* Participate in software architecture, design discussions, and code reviews\n* Optimize application for maximum speed and scalability\n* Follow the company guidelines and best practices\n\n**Requirements:**\n\n* Good English Communication skills, verbal and written.\n* Must\\-Have worked with Flutter / Android Application development.\n* Excellent ability to develop \\& understand algorithms.\n* Strong knowledge of restful web services.\n* Experience in interacting with web services from the Flutter mobile platform.\n* Experience with Offline Storage, Threading, And Performance Tuning.\n* Strong knowledge of Push Notifications.\n* Analytical, Problem Solving, and Decision\\-Making Skills.\n* Should have knowledge of client requirements analysis\n\nJob Types: Full\\-time, Permanent\n\nPay: ₹200,000\\.00 \\- ₹500,000\\.00 per year\n\nBenefits:\n\n* Flexible schedule\n* Paid sick time\n* Paid time off\n\nSchedule:\n\n* Monday to Friday\n* Morning shift\n* Rotational shift\n\nExperience:\n\n* Flutter: 1 year (Required)\n\nWork Location: In person\n\nExpected Start Date: 24/01/2025",
        "company_industry": "",
        "company_url": "https://www.glassdoor.com/Overview/W-EI_IE1274999.htm",
        "company_logo": "https://media.glassdoor.com/sql/1274999/website-developers-india-squarelogo-1461648272421.png",
        "company_url_direct": "",
        "company_addresses": "",
        "company_num_employees": "",
        "company_revenue": "",
        "company_description": ""
      },
      {
        "id": "li-4052951573",
        "site": "linkedin",
        "job_url": "https://www.linkedin.com/jobs/view/4052951573",
        "job_url_direct": "",
        "title": "Frontend Developer",
        "company": "Information Security Media Group (ISMG)",
        "location": "Mumbai, Maharashtra, India",
        "date_posted": "2025-01-17",
        "job_type": "",
        "salary_source": "",
        "interval": "",
        "min_amount": "",
        "max_amount": "",
        "currency": "",
        "is_remote": "",
        "job_level": "",
        "job_function": "",
        "listing_type": "",
        "emails": "",
        "description": "",
        "company_industry": "",
        "company_url": "https://www.linkedin.com/company/information-security-media-group-corp-ismg",
        "company_logo": "",
        "company_url_direct": "",
        "company_addresses": "",
        "company_num_employees": "",
        "company_revenue": "",
        "company_description": ""
      },
      {
        "id": "li-4055750352",
        "site": "linkedin",
        "job_url": "https://www.linkedin.com/jobs/view/4055750352",
        "job_url_direct": "",
        "title": "Assistant Manager",
        "company": "Larsen & Toubro",
        "location": "",
        "date_posted": "2025-01-17",
        "job_type": "",
        "salary_source": "",
        "interval": "",
        "min_amount": "",
        "max_amount": "",
        "currency": "",
        "is_remote": "",
        "job_level": "",
        "job_function": "",
        "listing_type": "",
        "emails": "",
        "description": "",
        "company_industry": "",
        "company_url": "https://in.linkedin.com/company/larsen-&-toubro-limited",
        "company_logo": "",
        "company_url_direct": "",
        "company_addresses": "",
        "company_num_employees": "",
        "company_revenue": "",
        "company_description": ""
      },
      {
        "id": "li-4103904917",
        "site": "linkedin",
        "job_url": "https://www.linkedin.com/jobs/view/4103904917",
        "job_url_direct": "",
        "title": "Data and Measurement Specialist, Large Customer Sales",
        "company": "Google",
        "location": "Mumbai, Maharashtra, India",
        "date_posted": "2025-01-17",
        "job_type": "",
        "salary_source": "",
        "interval": "",
        "min_amount": "",
        "max_amount": "",
        "currency": "",
        "is_remote": "",
        "job_level": "",
        "job_function": "",
        "listing_type": "",
        "emails": "",
        "description": "",
        "company_industry": "",
        "company_url": "https://www.linkedin.com/company/google",
        "company_logo": "",
        "company_url_direct": "",
        "company_addresses": "",
        "company_num_employees": "",
        "company_revenue": "",
        "company_description": ""
      },
      {
        "id": "li-3910936544",
        "site": "linkedin",
        "job_url": "https://www.linkedin.com/jobs/view/3910936544",
        "job_url_direct": "",
        "title": "Analyst",
        "company": "eClerx",
        "location": "Mumbai, Maharashtra, India",
        "date_posted": "2025-01-17",
        "job_type": "",
        "salary_source": "",
        "interval": "",
        "min_amount": "",
        "max_amount": "",
        "currency": "",
        "is_remote": "",
        "job_level": "",
        "job_function": "",
        "listing_type": "",
        "emails": "",
        "description": "",
        "company_industry": "",
        "company_url": "https://in.linkedin.com/company/eclerx",
        "company_logo": "",
        "company_url_direct": "",
        "company_addresses": "",
        "company_num_employees": "",
        "company_revenue": "",
        "company_description": ""
      },
      {
        "id": "li-4128263840",
        "site": "linkedin",
        "job_url": "https://www.linkedin.com/jobs/view/4128263840",
        "job_url_direct": "",
        "title": "Verification Specialist",
        "company": "First Advantage",
        "location": "Mumbai, Maharashtra, India",
        "date_posted": "2025-01-17",
        "job_type": "",
        "salary_source": "",
        "interval": "",
        "min_amount": "",
        "max_amount": "",
        "currency": "",
        "is_remote": "",
        "job_level": "",
        "job_function": "",
        "listing_type": "",
        "emails": "",
        "description": "",
        "company_industry": "",
        "company_url": "https://www.linkedin.com/company/first-advantage",
        "company_logo": "",
        "company_url_direct": "",
        "company_addresses": "",
        "company_num_employees": "",
        "company_revenue": "",
        "company_description": ""
      },
      {
        "id": "li-4109305730",
        "site": "linkedin",
        "job_url": "https://www.linkedin.com/jobs/view/4109305730",
        "job_url_direct": "",
        "title": "eCommerce Analyst - Online Brand Protection",
        "company": "Corsearch",
        "location": "",
        "date_posted": "2025-01-17",
        "job_type": "",
        "salary_source": "",
        "interval": "",
        "min_amount": "",
        "max_amount": "",
        "currency": "",
        "is_remote": "",
        "job_level": "",
        "job_function": "",
        "listing_type": "",
        "emails": "",
        "description": "",
        "company_industry": "",
        "company_url": "https://uk.linkedin.com/company/corsearchinc",
        "company_logo": "",
        "company_url_direct": "",
        "company_addresses": "",
        "company_num_employees": "",
        "company_revenue": "",
        "company_description": ""
      },
      {
        "id": "li-4094727106",
        "site": "linkedin",
        "job_url": "https://www.linkedin.com/jobs/view/4094727106",
        "job_url_direct": "",
        "title": "Data Centre Engineering Operations (Level 4), Infraops",
        "company": "Amazon Web Services (AWS)",
        "location": "",
        "date_posted": "2025-01-17",
        "job_type": "",
        "salary_source": "",
        "interval": "",
        "min_amount": "",
        "max_amount": "",
        "currency": "",
        "is_remote": "",
        "job_level": "",
        "job_function": "",
        "listing_type": "",
        "emails": "",
        "description": "",
        "company_industry": "",
        "company_url": "https://www.linkedin.com/company/amazon-web-services",
        "company_logo": "",
        "company_url_direct": "",
        "company_addresses": "",
        "company_num_employees": "",
        "company_revenue": "",
        "company_description": ""
      },
      {
        "id": "li-4127736509",
        "site": "linkedin",
        "job_url": "https://www.linkedin.com/jobs/view/4127736509",
        "job_url_direct": "",
        "title": "Web Frontend Engineer - JS, CSS, React, Flutter",
        "company": "Canonical",
        "location": "",
        "date_posted": "2025-01-16",
        "job_type": "",
        "salary_source": "",
        "interval": "",
        "min_amount": "",
        "max_amount": "",
        "currency": "",
        "is_remote": "",
        "job_level": "",
        "job_function": "",
        "listing_type": "",
        "emails": "",
        "description": "",
        "company_industry": "",
        "company_url": "https://uk.linkedin.com/company/canonical",
        "company_logo": "",
        "company_url_direct": "",
        "company_addresses": "",
        "company_num_employees": "",
        "company_revenue": "",
        "company_description": ""
      },
      {
        "id": "li-4128580498",
        "site": "linkedin",
        "job_url": "https://www.linkedin.com/jobs/view/4128580498",
        "job_url_direct": "",
        "title": "Zee - Executive - Customer Lifecycle Management - ZEE5 Global",
        "company": "ZEE5",
        "location": "",
        "date_posted": "",
        "job_type": "",
        "salary_source": "",
        "interval": "",
        "min_amount": "",
        "max_amount": "",
        "currency": "",
        "is_remote": "",
        "job_level": "",
        "job_function": "",
        "listing_type": "",
        "emails": "",
        "description": "",
        "company_industry": "",
        "company_url": "https://in.linkedin.com/company/zee5",
        "company_logo": "",
        "company_url_direct": "",
        "company_addresses": "",
        "company_num_employees": "",
        "company_revenue": "",
        "company_description": ""
      },
      {
        "id": "li-4055750353",
        "site": "linkedin",
        "job_url": "https://www.linkedin.com/jobs/view/4055750353",
        "job_url_direct": "",
        "title": "Assistant Manager CRM",
        "company": "Larsen & Toubro",
        "location": "",
        "date_posted": "",
        "job_type": "",
        "salary_source": "",
        "interval": "",
        "min_amount": "",
        "max_amount": "",
        "currency": "",
        "is_remote": "",
        "job_level": "",
        "job_function": "",
        "listing_type": "",
        "emails": "",
        "description": "",
        "company_industry": "",
        "company_url": "https://in.linkedin.com/company/larsen-&-toubro-limited",
        "company_logo": "",
        "company_url_direct": "",
        "company_addresses": "",
        "company_num_employees": "",
        "company_revenue": "",
        "company_description": ""
      }
    ],
    "status": true
  }